tylertms/cortex-m4-sim/src/device/kinetis_k22/device.c
const char* kinetis_k22_package_code(KinetisK22Package package) {
    if (package == KINETIS_K22_PACKAGE_DEFAULT) {
        return NULL;
    }
    const K22Package* match = k22_package_get((K22PackageId)package);
    return match == NULL ? NULL : match->code;
}

static void destroy_partial(KinetisK22* device) {
    if (device == NULL) {
        return;
    }
    cortex_m4_destroy(device->cpu);
    k22_data_destroy(device->data);
    k22_sdhc_destroy(&device->sdhc);
    free(device->flexbus_memory);
    free(device->flash);
    free(device->sram);
    free(device->peripheral);
    free(device);
}

KinetisK22* kinetis_k22_create(KinetisK22Configuration configuration) {
    const K22Profile* profile = k22_profile_get(configuration.profile);
    const K22RegisterManifest* manifest = k22_register_manifest_get(configuration.profile);
    if (profile == NULL || manifest == NULL) {
        return NULL;
    }
    const K22PackageSelection* package =
        configuration.package == KINETIS_K22_PACKAGE_DEFAULT
            ? k22_package_default(profile)
            : k22_package_select(profile, (K22PackageId)configuration.package);
    if (package == NULL || configuration.flash_size == 0 ||
        configuration.flash_size > profile->program_flash_size || configuration.sram_size == 0 ||
        configuration.sram_size > 0x40000000u) {
        return NULL;
    }
    KinetisK22* device = calloc(1, sizeof(*device));
    if (device == NULL) {
        return NULL;
    }
    device->configuration = configuration;
    device->profile = profile;
    device->package = package;
    device->manifest = manifest;
    const size_t profile_sram_size = (size_t)profile->sram_lower_size + profile->sram_upper_size;
    device->sram_base = configuration.sram_size == profile_sram_size
                            ? profile->sram_lower_address
                            : K22_SRAM_CENTER - (uint32_t)(configuration.sram_size / 2u);
    device->flash = malloc(configuration.flash_size);
    device->sram = calloc(1, configuration.sram_size);
    device->peripheral = calloc(1, K22_PERIPHERAL_SIZE);
    if (device->flash == NULL || device->sram == NULL || device->peripheral == NULL) {
        destroy_partial(device);
        return NULL;
    }
    memset(device->flash, 0xff, configuration.flash_size);
    if (!k22_serial_init(&device->serial, profile) ||
        !k22_sdhc_init(&device->sdhc, kinetis_k22_sdhc_bus(device)) ||
        !k22_timing_init(&device->timing, profile, configuration.external_oscillator_hz,
                         configuration.rtc_oscillator_hz, kinetis_k22_timing_signals(device)) ||
        !k22_io_init(&device->io, kinetis_k22_io_configuration(device))) {
        destroy_partial(device);
        return NULL;
    }
    device->data = k22_data_create(profile, kinetis_k22_data_bus(device));
    if (device->data == NULL) {
        destroy_partial(device);
        return NULL;
    }
    kinetis_k22_sync_clock_gates(device);
    CortexM4Bus bus = {device, k22_read_bus, k22_write_bus, k22_advance_bus, k22_reset_bus};
    device->cpu = cortex_m4_create(bus);
    if (device->cpu == NULL ||
        !cortex_m4_configure_implementation(device->cpu, profile->cpu.external_irq_count,
                                            profile->cpu.nvic_priority_bits,
                                            profile->cpu.has_mpu ? 8u : 0u)) {
        destroy_partial(device);
        return NULL;
    }
    return device;
}

void kinetis_k22_destroy(KinetisK22* device) { destroy_partial(device); }

CortexM4* kinetis_k22_cpu(KinetisK22* device) { return device == NULL ? NULL : device->cpu; }

const CortexM4* kinetis_k22_cpu_const(const KinetisK22* device) {
    return device == NULL ? NULL : device->cpu;
}

static void sync_flash_configuration(KinetisK22* device) {
    K22PeripheralBlock block;
    if (!k22_profile_peripheral_block(device->profile, K22_PERIPHERAL_FLASH_CONFIG, &block) ||
        block.address + block.size > device->configuration.flash_size) {
        return;
    }
    (void)k22_data_set_flash_configuration(device->data, device->flash + block.address, block.size);
    memcpy(device->io.configuration.flash_configuration, device->flash + block.address, block.size);
}

bool kinetis_k22_reset(KinetisK22* device) {
    if (device == NULL) {
        return false;
    }
    memset(device->sram, 0, device->configuration.sram_size);
    device->cycles = 0;
    device->timing.elapsed_core_cycles = 0;
    sync_flash_configuration(device);
    kinetis_k22_peripheral_reset(device);
    k22_timing_reset(&device->timing, 0x82u, 0);
    kinetis_k22_sync_clock_gates(device);
    const bool reset = cortex_m4_reset(device->cpu, device->configuration.vector_table_address);
    fmc_clear_cache(device);
    return reset;
}

void kinetis_k22_warm_reset(KinetisK22* device, uint8_t cause_0, uint8_t cause_1) {
    if (device == NULL) {
        return;
    }
    uint8_t retained_vbat[0x20];
    memcpy(retained_vbat, device->peripheral + 0x3e000u, sizeof(retained_vbat));
    sync_flash_configuration(device);
    kinetis_k22_peripheral_reset(device);
    memcpy(device->peripheral + 0x3e000u, retained_vbat, sizeof(retained_vbat));
    k22_timing_warm_reset(&device->timing, cause_0, cause_1);
    kinetis_k22_sync_clock_gates(device);
    (void)cortex_m4_reset(device->cpu, device->configuration.vector_table_address);
    fmc_clear_cache(device);
}

bool kinetis_k22_load(KinetisK22* device, uint32_t address, const void* data, size_t size) {
    if (device == NULL || data == NULL) {
        return false;
    }
    if (address < device->configuration.flash_size &&
        (uint64_t)address + size <= device->configuration.flash_size) {
        memcpy(device->flash + address, data, size);
        fmc_clear_cache(device);
        sync_flash_configuration(device);
        return true;
    }
    if (address >= device->sram_base &&
        (uint64_t)address + size <= (uint64_t)device->sram_base + device->configuration.sram_size) {
        memcpy(device->sram + address - device->sram_base, data, size);
        return true;
    }
    return false;
}

