tylertms/cortex-m4-sim/src/device/kinetis_k22/device.c
bool kinetis_k22_seed(KinetisK22* device, uint32_t address, const void* data, size_t size) {
    return kinetis_k22_write(device, address, data, size);
}

bool kinetis_k22_read(const KinetisK22* device, uint32_t address, void* data, size_t size) {
    if (device == NULL || data == NULL) {
        return false;
    }
    uint8_t* output = data;
    size_t offset = 0;
    while (offset < size) {
        const size_t remaining = size - offset;
        const uint8_t width = remaining >= 4 && ((address + offset) & 3u) == 0   ? 4
                              : remaining >= 2 && ((address + offset) & 1u) == 0 ? 2
                                                                                 : 1;
        uint32_t value = 0;
        if (!k22_read_bus((KinetisK22*)device, address + (uint32_t)offset, width,
                          CORTEX_M4_ACCESS_DEBUG, &value)) {
            return false;
        }
        store_little_endian(output + offset, width, value);
        offset += width;
    }
    return true;
}

bool kinetis_k22_write(KinetisK22* device, uint32_t address, const void* data, size_t size) {
    if (device == NULL || data == NULL) {
        return false;
    }
    const uint8_t* input = data;
    size_t offset = 0;
    while (offset < size) {
        const size_t remaining = size - offset;
        const uint8_t width = remaining >= 4 && ((address + offset) & 3u) == 0   ? 4
                              : remaining >= 2 && ((address + offset) & 1u) == 0 ? 2
                                                                                 : 1;
        const uint32_t value = load_little_endian(input + offset, width);
        if (!k22_write_bus(device, address + (uint32_t)offset, width, CORTEX_M4_ACCESS_DEBUG,
                           value)) {
            return false;
        }
        offset += width;
    }
    return true;
}

bool kinetis_k22_copy(KinetisK22* destination, const KinetisK22* source) {
    if (destination == NULL || source == NULL || destination->profile->id != source->profile->id ||
        destination->package != source->package ||
        destination->configuration.flash_size != source->configuration.flash_size ||
        destination->configuration.sram_size != source->configuration.sram_size) {
        return false;
    }
    memcpy(destination->flash, source->flash, source->configuration.flash_size);
    memcpy(destination->sram, source->sram, source->configuration.sram_size);
    memcpy(destination->peripheral, source->peripheral, K22_PERIPHERAL_SIZE);
    destination->configuration = source->configuration;
    destination->cycles = source->cycles;
    destination->cmt_cycles = source->cmt_cycles;
    destination->cmt_bus_remainder = source->cmt_bus_remainder;
    destination->cmt_mark_ticks = source->cmt_mark_ticks;
    destination->cmt_period_ticks = source->cmt_period_ticks;
    destination->cmt_carrier_high_ticks = source->cmt_carrier_high_ticks;
    destination->cmt_carrier_period_ticks = source->cmt_carrier_period_ticks;
    destination->cmt_carrier_offset_ticks = source->cmt_carrier_offset_ticks;
    destination->cmt_output_delay_ticks = source->cmt_output_delay_ticks;
    destination->cmt_eoc_read = source->cmt_eoc_read;
    destination->cmt_running = source->cmt_running;
    destination->cmt_stop_pending = source->cmt_stop_pending;
    destination->cmt_fsk_secondary = source->cmt_fsk_secondary;
    destination->cmt_extended_space = source->cmt_extended_space;
    destination->cmt_dma_pending = source->cmt_dma_pending;
    memcpy(destination->fmc_bank, source->fmc_bank, sizeof(destination->fmc_bank));
    memcpy(destination->fmc_age, source->fmc_age, sizeof(destination->fmc_age));
    destination->fmc_access_count = source->fmc_access_count;
    (void)k22_usbdcd_copy(&destination->usbdcd, &source->usbdcd);
    memcpy(destination->comparator_output, source->comparator_output,
           sizeof(destination->comparator_output));
    memcpy(destination->events, source->events, sizeof(destination->events));
    destination->event_read_index = source->event_read_index;
    destination->event_write_index = source->event_write_index;
    destination->event_count = source->event_count;
    if (!k22_data_copy(destination->data, source->data) ||
        !k22_sdhc_copy(&destination->sdhc, &source->sdhc, kinetis_k22_sdhc_bus(destination)) ||
        !k22_serial_copy(&destination->serial, &source->serial) ||
        !k22_io_copy(&destination->io, &source->io) ||
        !k22_timing_copy(&destination->timing, &source->timing,
                         kinetis_k22_timing_signals(destination))) {
        return false;
    }
    destination->io.configuration.event_handler =
        kinetis_k22_io_configuration(destination).event_handler;
    destination->io.configuration.event_context = destination;
    if (source->flexbus_memory != NULL) {
        if (!kinetis_k22_flexbus_attach(destination, source->flexbus_address,
                                        source->flexbus_memory, source->flexbus_size,
                                        source->flexbus_read_only))
            return false;
    } else {
        kinetis_k22_flexbus_detach(destination);
    }
    return cortex_m4_copy(destination->cpu, source->cpu);
}

bool kinetis_k22_flexbus_attach(KinetisK22* device, uint32_t address, const void* data, size_t size,
                                bool read_only) {
    if (device == NULL || data == NULL || size == 0u ||
        (uint64_t)address + size > UINT64_C(0x100000000) ||
        !k22_package_has_peripheral(device->package, K22_PERIPHERAL_FB))
        return false;
    uint8_t* memory = malloc(size);
    if (memory == NULL)
        return false;
    memcpy(memory, data, size);
    free(device->flexbus_memory);
    device->flexbus_memory = memory;
    device->flexbus_address = address;
    device->flexbus_size = size;
    device->flexbus_read_only = read_only;
    return true;
}

void kinetis_k22_flexbus_detach(KinetisK22* device) {
    if (device == NULL)
        return;
    free(device->flexbus_memory);
    device->flexbus_memory = NULL;
    device->flexbus_address = 0u;
    device->flexbus_size = 0u;
    device->flexbus_read_only = false;
}

bool kinetis_k22_flexbus_read(const KinetisK22* device, size_t offset, void* data, size_t size) {
    if (device == NULL || data == NULL || device->flexbus_memory == NULL ||
        offset > device->flexbus_size || size > device->flexbus_size - offset)
        return false;
    memcpy(data, device->flexbus_memory + offset, size);
    return true;
}

void kinetis_k22_advance(KinetisK22* device, uint32_t cycles) {
    if (device != NULL && cycles != 0) {
        k22_advance_bus(device, cycles);
    }
}

void kinetis_k22_watchdog_advance(KinetisK22* device, uint32_t ticks) {
    if (device != NULL)
        k22_timing_watchdog_advance(&device->timing, ticks);
}

uint32_t kinetis_k22_core_clock_hz(const KinetisK22* device) {
    return device == NULL ? 0 : k22_timing_core_clock_hz(&device->timing);
}

uint32_t kinetis_k22_bus_clock_hz(const KinetisK22* device) {
    return device == NULL ? 0 : k22_timing_bus_clock_hz(&device->timing);
}
